Repository: giellalt/corpus-fin
Catalog: tmx/smn/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=289_lang=finnish.html.tmx
Source language: fin
Languages: smn

source: Saamen kieltä ja opetusta tulisi kehittää kokonaisvaltaisesti
smn: Sämikielâ já máttááttâs kolgâččij ovdediđ olesváldálávt

source: Suomessa tulisi käynnistää kokonaisvaltainen saamen kielen elvytysohjelma ja aloittaa saamen kielen ja saamenkielisen opetuksen kokonaisvaltainen kehittäminen.
smn: Suomâst kolgâččij pieijâđ joton olesváldálâš sämikielâ iäláskittemohjelm já algâttiđ sämikielâ já sämikielâlâš máttááttâs olesváldálâš ovdedem.

source: Kaikki kolme Suomessa puhuttua saamen kieltä ovat tutkimusten ja kansainvälisten luokitusten mukaan uhanalaisia kieliä, jotka tarvitsevat erityistä tukea siirtyäkseen aktiivisina käyttökielinä uusille sukupolville.
smn: Puoh kulmâ Suomâst sarnum sämikielâ láá tutkâmušâi já aalmugijkoskâsâš luokittâllâm mield uhkevuálásâš kielah, moh tarbâšeh sierânâs torjuu vâi pyehtih sirdâšuđ aktiivlâš kevttimkiellân uđđâ suhâpuolváid.

source: Koululla on tässä erityisen tärkeä asema.
smn: Škoovlâin lii táágu eromâš tehálâš sajattâh.

source: Opetusministerille luovutetut muistiot voi avata tästä:
smn: Máttááttâsministerin luovâttum muštottemčálusijd puáhtá lekkâđ täst:

source: Taustamuistio opetusministeri Henna Virkkuselle 290509
smn: já
